app/controllers/admin/dashboard_controller.rb

  def index
    @users = User.all
    @status = Status.all
---
SELECT "users".* FROM "users"
SELECT "statuses".* FROM "statuses"