app/views/orders/_order_new.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."coff_id" = 2 AND (status_id = 1)
SELECT COUNT(*) FROM "orders" WHERE "orders"."coff_id" = 2 AND (status_id = 1)
---
   <% @coffee_all.each do |coffee| %>
      <% if(coffee.orders.count>0) %>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "coffs".* FROM "coffs" WHERE "coffs"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = $1 LIMIT 1  [["id", 1]]
---
                    <%
                    user = User.find(order.user_id)
                    coffee = Coff.find(order.coff_id)
                    status = Status.find(order.status_id)