app/views/orders/_take_order.html.erb

SELECT "coffs".* FROM "coffs"
---
                 <%=form_for @order do |f| %>
                    <%=f.select :coff_id, Coff.all.collect {|x| [x.name + "("+ x.price.to_s+ "฿)", x.id]} %>