app/views/orders/history.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "coffs".* FROM "coffs" WHERE "coffs"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = $1 LIMIT 1  [["id", 2]]
---
					<%
						user = User.find(order.user_id)
						coffee = Coff.find(order.coff_id)
						status = Status.find(order.status_id)