app/views/orders/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
<%
	user = User.find(order.user_id)