app/controllers/coffs_controller.rb

SELECT "coffs".* FROM "coffs"
---
  def index
    @coffs = Coff.all

SELECT "coffs".* FROM "coffs" WHERE "coffs"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @coff = Coff.find(params[:id])

INSERT INTO "coffs" ("created_at", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "name", "price", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @coff = Coff.new(params[:coff])

    respond_to do |format|
      if @coff.save