app/controllers/orders_controller.rb

	def create
		@order = Order.new(params[:order])
		@order.user_id = current_user.id
		@order.status_id = 1 #default



	    # respond_to do |format|
	     if @order.save
---
INSERT INTO "orders" ("coff_id", "comment", "created_at", "status_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["coff_id", 1], ["comment", nil], ["created_at", Fri, 23 Nov 2012 07:39:55 UTC +00:00], ["status_id", 1], ["updated_at", Fri, 23 Nov 2012 07:39:55 UTC +00:00], ["user_id", 1]]

	def history
		@done_cancel = Order.paginate(:page => params[:page]).done_cancel.order_desc
---
SELECT "orders".* FROM "orders" WHERE (status_id <> 1) ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders" WHERE (status_id <> 1)

	def index
		@user = current_user
    	@orders_new = Order.new_order.order_desc
   		@orders_history = Order.history.order_desc
    	@orders_cancled = Order.cancel.order_desc
    	@order = Order.new
    	@done_cancel = Order.paginate(:page => params[:page]).done_cancel.order_desc
    	@coffee_all = Coff.all
---
SELECT "orders".* FROM "orders" WHERE (status_id <> 1) ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders" WHERE (status_id <> 1)
SELECT "coffs".* FROM "coffs"

    def destroy
	    order = Order.find(params[:id])
	    order.destroy
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", "4"]]
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 4]]

 	def update
	  	order = Order.find(params[:id])
	  	order.status_id = params[:status]

	    respond_to do |format|
	     # if order.update_attributes(params[:coff])
	     if order.save
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "orders" SET "status_id" = 2, "updated_at" = '2012-11-23 07:48:52.451261' WHERE "orders"."id" = 2

	def clear


	    respond_to do |format|
	     # if order.update_attributes(params[:coff])
	     if Order.update_all(:status_id => Status::DONE_ID)
---
UPDATE "orders" SET "status_id" = 2